Tekla Open API Reference for Tekla Structures 2025
AnalysisArea.GetInnerPositions Method
 Gets the inner positions of the analysis area.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetInnerPositions()
Public Function GetInnerPositions As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
The inner positions of the analysis area.
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace